
const fonts = {
  gothicBold: {
    A: '𝕬', B: '𝕭', C: '𝕮', D: '𝕯', E: '𝕰', F: '𝕱', G: '𝕲', H: '𝕳',
    I: '𝕴',J: '𝕵',K: '𝕶',L: '𝕷',M: '𝕸',N: '𝕹',O: '𝕺',P: '𝕻',Q: '𝕼',
    R: '𝕽',S: '𝕾',T: '𝕿',U: '𝖀',V: '𝖁',W: '𝖂',X: '𝖃',Y: '𝖄',Z: '𝖅',
    a: '𝖆',b: '𝖇',c: '𝖈',d: '𝖉',e: '𝖊',f: '𝖋',g: '𝖌',h: '𝖍',i: '𝖎',j: '𝖏',
    k: '𝖐',l: '𝖑',m: '𝖒',n: '𝖓',o: '𝖔',p: '𝖕',q: '𝖖',r: '𝖗',s: '𝖘',t: '𝖙',
    u: '𝖚',v: '𝖛',w: '𝖜',x: '𝖝',y: '𝖞',z: '𝖟',
  },
  gothic: {
    A: '𝔄',B: '𝔅',C: 'ℭ',D: '𝔇',E: '𝔈',F: '𝔉',G: '𝔊',H: 'ℌ',I: 'ℑ',J: '𝔍',
    K: '𝔎',L: '𝔏',M: '𝔐',N: '𝔑',O: '𝔒',P: '𝔓',Q: '𝔔',R: 'ℜ',S: '𝔖',T: '𝔗',
    U: '𝔘',V: '𝔙',W: '𝔚',X: '𝔛',Y: '𝔜',Z: 'ℨ',a: '𝔞',b: '𝔟',c: '𝔠',d: '𝔡',
    e: '𝔢',f: '𝔣',g: '𝔤',h: '𝔥',i: '𝔦',j: '𝔧',k: '𝔨',l: '𝔩',m: '𝔪',n: '𝔫',o: '𝔬',
    p: '𝔭',q: '𝔮',r: '𝔯',s: '𝔰',t: '𝔱',u: '𝔲',v: '𝔳',w: '𝔴',x: '𝔵',y: '𝔶',z: '𝔷',
  },
  halfling: {
    A: 'ค',B: '๒',C: 'ς',D: '๔',E: 'є',F: 'Ŧ',G: 'ﻮ',H: 'ђ',I: 'เ',J: 'ן',
    K: 'к',L: 'ɭ',M: '๓',N: 'ภ',O: '๏',P: 'ק',Q: 'ợ',R: 'г',S: 'ร',T: 'Շ',
    U: 'ย',V: 'ש',W: 'ฬ',X: 'א',Y: 'ץ',Z: 'չ',a: 'ค',b: '๒',c: 'ς',d: '๔',
    e: 'є',f: 'Ŧ',g: 'ﻮ',h: 'ђ',i: 'เ',j: 'ן',k: 'к',l: 'ɭ',m: '๓',n: 'ภ',
    o: '๏',p: 'ק',q: 'ợ',r: 'г',s: 'ร',t: 'Շ',u: 'ย',v: 'ש',w: 'ฬ',x: 'א',
    y: 'ץ',z: 'չ',
  },
  dwarvish: {
    A: 'ል',B: 'ጌ',C: 'ር',D: 'ዕ',E: 'ቿ',F: 'ቻ',G: 'ኗ',H: 'ዘ',I: 'ጎ',J: 'ጋ',
    K: 'ጕ',L: 'ረ',M: 'ጠ',N: 'ክ',O: 'ዐ',P: 'የ',Q: 'ዒ',R: 'ዪ',S: 'ነ',T: 'ፕ',
    U: 'ሁ',V: 'ሀ',W: 'ሠ',X: 'ሸ',Y: 'ሃ',Z: 'ጊ',a: 'ል',b: 'ጌ',c: 'ር',d: 'ዕ',
    e: 'ቿ',f: 'ቻ',g: 'ኗ',h: 'ዘ',i: 'ጎ',j: 'ጋ',k: 'ጕ',l: 'ረ',m: 'ጠ',n: 'ክ',
    o: 'ዐ',p: 'የ',q: 'ዒ',r: 'ዪ',s: 'ነ',t: 'ፕ',u: 'ሁ',v: 'ሀ',w: 'ሠ',x: 'ሸ',
    y: 'ሃ',z: 'ጊ',
  }
}

export const convertFont = (message, type) => {
  if (!fonts[type]) return message
  return message.split('').map(letter => fonts[type][letter] || letter).join('')
}